<!DOCTYPE html>
<html>
<head>
	<meta charset="utf-8">
	<title>解籤</title>
    <style type="text/css">
    body{background-image: linear-gradient(-20deg, #e9defa 0%, #fbfcdb 100%);
         font-family: DFKai-sb;
      }
    .a{
        margin:50px;
        padding:30px;
        height:380px;
        background-color:#F4F4F4;
        border-radius: 40px ;
    }
    header{background-color: ivory;
           text-align:left;
           font-size: 45px;
           position: fixed;
           top:0;
           left:0;
           width:100%;
           padding:0px;
           color:black;
    }

button{font-size: 10px;
       text-align: center;
       width:170px;
       background-color:#A43B35;
       padding:5px;
       border-radius:20px;
          }

button:hover{
       background-color:#C15E58;
        }
a{font-size: 25px;
  text-decoration:none;
  color:white;
 }
a:hover {text-decoration:underline;
         color:C15E58;
        }
a:active {
text-decoration:none;
color:blue;
}

h2{text-align:center;
   color:#267326;
  font-size: 35px;
}
p{text-align:left;
  color:#5c5c8a;
  font-size: 23px;
}

li{text-align:left;
   font-size: 20px;
   color:#171717;
}
#f{margin:30px;
   padding:50px;
   background-color:#ecd8c6;
}
#g{margin:30px;
   padding:50px;
   background-color:#ffeecc;
}
table{font-size: 23px;
     text-align:left;
     border:8px #fab4c9 groove;
     position:center;
     cellpadding="10";
    }
.td{width:500px;
    color:#994d00;
    bgcolor:##ff0066;
}
.y{text-align:left;
   color:#009999 ;
   font-size: 25px;
   }
 #k{background-size: cover;
         width:100%;
         height:350px;
    }
 .r{color:#ff4d4d ;

 }
 #u{margin:0px;
   padding:30px;
   background-color:#A43B35;
 }
 #m{margin:50px;
        padding:50px;
        height:250px;
        background-color:#F4F4F4;
        border-radius: 40px ;
 }
 #c{margin:50px;
        padding:60px;
        height:400px;
        background-color:#F4F4F4;
        border-radius: 40px ;
 }
 #ya{text-align:center;
   color:#8080ff ;
   font-size: 25px;
 }
 #s{font-size: 23px;
       width:100px;
       background-color:#ccccff;
       padding:5px;
       border-radius:5px;
       color:#
 }
 #s:hover{
       background-color:#ffcce6;
        }
 .f{text-align:center;
   color:#ff9999 ;
   font-size: 25px;
 }
 #x{text-align:left;
   color:#993366;
  font-size: 25px;

 }
 #po{text-align:left;
  color:#476b6b;
  font-size: 23px;
 }
 #l{text-align:right;
  color:#ff0000;
  font-size: 25px;
 }
 input{font-family: DFKai-sb;
    font-size: 20px;
}
.r{text-align: center;

}
img{position:center;

}
</style>
</head>
<body>
    <header>
    <img src="3.jpg" width="190"align=left>
    <br>&nbsp;&nbsp;
    七天玄女宮
</div>
<div id="l">
<form action="https://www.google.com/search" method="get" align="right" target="_blank" ><b>
Google搜尋:&nbsp;&nbsp;</b> <input type="text"name="q"placeholder="請輸入關鍵字">&nbsp;&nbsp;
<input type="submit" value="🔍" >
</form>
</div>
<div id="u">
<button><a href="index.php"><b>🏠首頁</b></a></button>
<button><a href="1.html"><b>安太歲</b></a></button>
<button><a href="2.php"><b>借發財金</b></a></button>
<button><a href="3-1.php"><b>月老求籤占卜</b></a></button>
<button><a href="4.html"><b>樂捐香油錢</b></a></button>
</div>
</header>
<br><br><br><br><br><br><br><br><br><br>
<br><br><br><br><br>
</head>
	<?php

    $a = rand(1,40) ;

     echo "你抽到第".$a ."籤";

      if($a == 1){
     	echo "
     	<h1>第 1 籤　&nbsp;甲子籤</h1>
     	<img  src='1.png'align=center><br>
     	<p>
     	只要太陽一出來，一切就會風消雲散；只要光明一普照，世間便見清淨太平。前途是光明正大，只要努力前進，正是：「條條大路通羅馬。」只要你做事問心無愧，神明自會保佑你萬事清吉平安！<br>抽到此籤，表示謀望難成，但是不可灰心，只要鍥而不捨，繼續追求，認真努力，自然有成功的一天。求財交易，利潤輕微。問功名，有志竟成。問婚姻，有情人終成眷屬。問訴訟，若蒙冤終獲平反，如係民事，以和為貴。<br>某公務員因案被停職，至省城隍廟抽得此籤，一看「日出便見風雲散，光明清淨照世間」句，心裡便很感安慰，知道明鏡高懸，必得清白。果然，未久即獲法院平反，仍復原職。<br>又某生聯考落第，心甚徬徨，不知何去何從，有日至本廟抽得此籤，廟祝勸其再接再厲，翌年聯考，果然金榜題名。</p> ";
    }elseif($a == 2) {
     	echo "
     	<h1><第 2 籤　&nbsp;甲寅籤</h1>
     	<img  src='2.png'><br>
     	<p>
     	冬天到了，春天還會遠嗎？你不看看週圍的景色多美，那百花正在含苞待放，嬌嬌欲滴，只要那春光一到，立刻會有一番新氣象。正是：「春到碧桃枝上，花發滿城錦繡，鶯歌綠柳樓前，春生大地文章。」<br>抽得此籤，表示目前正是艱困的時期，但如能突破，接著而來的，必是一番鴻圖大展。故謀事失敗，不要灰心，東山再起；必獲成功。問功名；希望不大，好好充實自己，等待秋天再進。問婚姻，很有希望，好消息就到。問疾病，新春可癒。出外旅行，春天最好。遷移或變動職位，目前不宜。求財交易，眼光須放遠，不可只求近利。<br>中部某工廠因受他廠倒閉影響，陷於週轉不靈，負責人焦慮至急，不知是否能渡過難關，乃至省城隍前問卜，抽得此籤。當時已屆隆冬，持籤來余處求解，乃勸慰他再艱苦奮鬥一段時間，過了年必可過關。果然，翌年春，因經濟復甦，景氣又熱，工廠生意興隆，乃安然渡過難關。正應了：「若能退得春色到，一灑清吉脫塵埃。」
     	</p>";
    }elseif($a == 3) {
     	echo "
     	<h1>第 3 籤　&nbsp;甲辰籤</h1>
     	<img  src='3.png'><br>
     	<p>
     	勸你不要再三心兩意了，姻緣天註定，是不能勉強的，所謂：「有緣千里來相會，無緣對面不相逢。」天作之合，佳偶天成，緣分一到，你一定會遇到你所追尋的「明珠」！<br>抽得此籤，若問婚姻，乃告訴當事人「情」要「專」，自然「有情人終成眷屬」。問事業，告訴當事人要「定性」，不可換來換去，所謂「十做九不成」。即使受了一次挫折，再接再勵，必獲成功。如果稍受挫折，就放棄不做。就永無成功之時。問求財，出外有利。問功名，尚須努力。問疾病，情況不穩。問移居，可得平安。<br>有某對男女，情投意合，因相差六歲，女方家長迷信俗忌，不肯答應親事，僵持兩年，不能成好事。後來，男方家長逼其子另娶，其子因愛其女友，不肯就範。乃到省城隍廟求得此籤，一看：「勸君把定心莫虛」句，乃更加堅定立場，終於感動女方家長，有情人終成眷屬。</p>";
    }elseif ($a == 4) {
     	echo "
     	<h1>第 4 籤　&nbsp;甲午籤</h1>
     	<img  src='4.png'><br>
     	<p>
     	風平浪靜，船行一帆風順，正像中秋明月，圓滿皎潔。凡事不必多憂慮，福祿自有不必求，時來運轉，自然喜慶滿門。<br>這是一首很幸運的籤詩；表示一切順調如意，圓滿達成。如果是一位應考的人，抽得此籤，是金榜題名的好兆。<br>這首籤詩除了表示功名有望，福祿全外，如問訴訟，表示得直。如問疾病，可以痊癒。如問婚姻，表示美滿。如問移居，一切安好。<br>友人某，秋季赴考，抽得此籤，果然，考場得意，連中留學考與高考。<br>又某人欲與人合夥經營餐廳，抽得此籤，至余處求解。因時值仲夏，天氣熬熱，乃想到「中秋月一輪」句，乃秋金之象，而仲夏屬火，火剋金，而餐廳業亦屬火，籤詩意義雖佳，恐另有他意。只好囑其慎重考慮。該餐廳開業不久，果然因裝潢開支過多，股東意見不合而關閉。故此籤對求財，有畫餅之意，好看而不中吃，須慎之。</p>";
    }elseif ($a == 5) {
     	echo "
     	<h1>第 5 籤　&nbsp;甲申籤</h1>
     	<img  src='5.png'><br>
     	<p>
     	太只恐怕前去途中明明有變故，勸你莫著急。做事既然搶不著先機，就暫時守住長江看看，命裡有太白金星保佑，自然不會有什麼大事發生。<br>這首籤詩暗示，做事要有先見之明，如果時機錯過了，就不宜妄動。譬如開工廠，當景氣好時，你才開始設廠，等你開始生產時，景氣已經衰退，你就吃虧了。<br>抽到此籤，表示求謀不宜過急，所謂欲速不達，且須等待時機。問婚姻，對方可能有意中人，成功希望不大。如果問訴訟，則和解為宜。問疾病，則宜多禱告神明保佑。應考功名，有希望，但不可心躁。求財平平，做事業宜按步就班，不可好高騖遠，才不致失敗。問遷移或變動職位，不好。總之，不妄動，再正心修德，自然安泰。<br>六十二年初，曾有某工廠董事長來訪，出示上籤，謂省城隍廟所抽，乃求解答可否增設新廠。余曰：「此籤有『且守長江無大事』句，神明要您固守，不宜另設新廠。」但因景氣過熱，經不住他人慫恿，乃又增設一新廠，結果遇到景氣衰退，工廠只好停工。</p>";
    }elseif ($a == 6) {
     	echo "
     	<h1>第 6 籤　&nbsp;甲戌籤</h1>
     	<img  src='6.png'><br>
     	<p>
     	風雲招來暴雨，一片汪洋，天災氣候造成了傷害。一個人命裡無時莫強求，既然沒有和合的希望，就不必再出外奔跑了。<br>這首籤詩，告示當事人：「命裏有時終須有，命裏無時莫強求。」強求也是沒有用的。就像那不測風雲造成的天災，乃是一種不可抗力的災害，是莫可奈何的呀！<br>這首籤詩，如果是占問合夥，乃不吉之兆。因詩中有「命內此事難和合」之句。據友人張君說，他與人合夥設立工廠時，曾到省城隍廟抽到此籤，當時曾想作罷，後因籌備已久，所費不少，乃勉強湊合。後來該工廠合夥人，竟將該廠帳款拐逃國外，正應了「更逢一足出外鄉」之句。<br>抽到此籤，問求財，不吉，無利可圖。問婚姻，莫強求，宜另找對象。問謀望，只要平心靜氣，順其自然，莫要強求，自然禍去福來。問訴訟，宜和解，莫信讒言。問遷移和變動職位，不可妄動。
     	</p>";
    }elseif ($a == 7) {
     	echo "
     	<h1>第 7 籤　&nbsp;乙丑籤</h1>
     	<img  src='7.png'><br>
     	<p>
     	雲開月出，大放光明，不須再問進退，可以直奔向前程。婚姻都是上天注定好的，只要是天作之合，一定美滿成功！<br>抽到此籤，如果是問運途，可以說是「否極泰來」，過去的烏雲已經散開了，被遮的月亮重放光明，即壞運已經過去了，現在已邁入好運了。如果問婚姻，表示佳偶天成，有情人終成眷屬。<br>此籤問做事，可以成功。問求財，開始見利。問出外移居，則不利。問疾病，則有驚無險。問訴訟，和解可無事。<br>某君欲移居國外，抽得此籤，不知可否，乃至余處請解。余曰：「此籤所示，恐去不成！」蓋籤詩中有「不須進退」句。果因簽證問題未能去成。後來因結識外國女友而去國，乃應了「婚姻皆由天注定，和合清吉萬事成」句。而第一次出國申請未成，係因資格問題，而第二次因婚姻關係而成功，也正應了「不須進退」「向前程」與「雲開月出」「正分明」句。</p>";
    }elseif ($a == 8) {
     	echo "
     	<h1>第 8 籤　&nbsp;乙卯籤</h1>
     	<img  src='8.png'><br>
     	<p>
     	看看田裏結成了稻穗，知道今年又豐收了。辛勤的耕耘，必有豐盛的收穫，這事是兩相關的呀！看到好的收成！心中多高興，回到家裏來，跟妻兒們同在一起，快快樂樂地跳舞一番！<br>這首籤詩是一首好籤，表示有一分耕耘，終有一分收穫。俗云：「大富由天，小富由勤」昔日的流汗，今天總看到豐滿的收成了。但如果沒有昔日的流汗，那有今天的收成呢？<br>抽到此籤，大抵先苦後甘，先否後泰。如果是問婚姻，表示有情人終成眷屬。問事業，要腳踏實地去做，不可做投機，投機必失敗。問功名，如果在秋天，有希望。如果在冬天，須待明年，再充實自己。
     	</p>";
    }elseif ($a == 9) {
     	echo "
     	<h1>第 9 籤　&nbsp;乙巳籤</h1>
     	<img  src='9.png'><br>
     	<p>
     	你我好比龍虎鬥，卻一起在那深山裏，沒有任何顧慮，卻不知這種相愛，乃是一種錯誤的決定，恐怕他日，會變成你我無干的局面！<br>這首籤詩暗示當事人，如果兩個志趣不合的人，勉強湊合，一定無法持久。所以如果問婚姻，是難偕白頭之兆。問合夥生意，最後會拆夥。而且恐怕會鬧得不愉快。<br>問謀事，因競爭的人太多，恐怕難遂意。問求財，問功名，都是一樣，很難。移居、出外旅行、變動職位，都不吉，宜靜守，不宜妄動。<br>曾有一對熱戀中男女持此籤來問，何時可以結婚？余曰：「此籤因有『龍虎相隨在深山』句，照說你們已經同居了，隨時都可以補辦結婚手續，不過，婚姻不能兒戲，要彼此真正相互瞭解，才能白頭偕老，有什麼事，能夠彼此互相忍讓，才能永結同心！」不久，聽說未辦結婚就已分開了。因為「龍虎」相隨，如果不能相互忍讓，就會「龍虎」相鬥。他倆不能領會我的話意，結果只有應了籤詩所說：「不知此去相愛悞，他日與我卻無干！」
     	</p>";
    }elseif ($a == 10) {
     	echo "
     	<h1>第 10 籤　&nbsp;乙未籤</h1>
     	<img  src='10.png'><br>
     	<p>
     	開花結果，卻是一半落空，收穫不多，可惜你今年的光陰算是虛度了。太陽漸漸向西山落去，俗云：「太陽雖好近黃昏」，勸你呀，看開一點吧，還是不用再奔波了！<br>這首籤詩暗示當事人徒勞無功，雖然過去有過一段輝煌的日子，但結果成就卻不多，有一半以上是虛擲光陰了。所以籤詩勸他，還是腳踏實地，做些實在的事，何必去空忙一場呢？<br>抽到此籤，問外出，正如籤詩所說，空勞往返，所以不吉。問婚姻，因籤有「結子一半枯，今年汝虛度」之句，恐怕難成。移居、變動職位，均不吉。<br>有一考生，在校成績均名列前茅，頗自負，故聯考填志願時，僅填第一志願一處，餘均放棄。考試過後頗後悔，抽得此籤，自知該年沒有希望，後果名落孫山。正應了「可惜今年汝虛度」句。
     	</p>";
    }elseif ($a == 11) {
     	echo "
     	<h1>第 11 籤　&nbsp;乙酉籤</h1>
     	<img  src='11.png'><br>
     	<p>
     	靈雞一啼，天漸漸亮了，凡事就看明天吧！雲開月山，光照天下，你便可看到太平景象了！<br>這首籤詩的寓意是，黑夜過去了，雞一啼，黎明就接著來了。一個人一生不會都走霉運的，當那時來運轉，正如「雲開月出」，會有一番新氣象出現的！<br>抽到此籤，如問做事求財，可以說漸漸有希望了。靈雞(酉) 可以當做八月解釋，就是說八月以後，漸漸有希望了。子、丑、寅可以當做年尾（十一月、十二月）和明年初（正月）解（當然也可以當做子、丑、寅日解）。<br>這首籤詩是苦盡甘來之兆，所以問功名，表示你十年寒窗，有出頭的日子了。問婚姻，表示有情人終成眷屬。移居平安，出外可行。
     	</p>";
    }elseif ($a == 12) {
     	echo "
     	<h1>第 12 籤　&nbsp;乙亥籤</h1>
     	<img  src='12.png'><br>
     	<p>
     	長江的風浪漸漸平靜了，現在船隻可以前進，並且可以安寧無事了。只要積極前進，一定會有貴人相助，即使遇到困境，也能逢凶化吉，化險為夷！<br>抽得此籤，先凶後吉，逢凶化吉之兆。如有困難，現在慢慢可以化解，不必憂慮，否極泰來，風浪終會過去的。<br>一生多貴人助，所以常能逢凶化吉。移居出外旅行，均吉。如問訴訟，可逢貴人而化平安。問功名，有貴人提拔之兆。問婚姻，只要媒人出面，婚談可成。<br>某君失業已久，窮極潦倒，一日赴省城隍廟，抽得此籤，信心大增，努力充實自己。正有某公司徵求外務員，乃前往應徵，即被錄取。後來躍升該公司經理，屢提此籤給他鼓勵甚大。
     	</p>";
    }elseif ($a == 13) {
     	echo "
     	<h1>第 13 籤　&nbsp;丙子籤</h1>
     	<img  src='13.png'><br>
     	<p>
     	命中正遇到「羅孛」凶星的關頭，雖然你用盡心機也避免不了，就是問神祈福，還是躲不過去，正像行船遇到沙灘，進退不得。<br>抽得此籤，表示你目前正在進退維谷的時候。問出外移居，不吉。老年人抽到此籤，表示一生空費心機，老來已無甚希望。若年青人抽到此籤，不必難過，正是考驗你的時候。只要你能克服困難，自有一光明的前程。<br>問功名，還要充實自己，目前希望不大。問婚姻，緣份未到恐難成，不宜勉強。問疾病，須謹慎醫治，少年人尚無礙，若老年人，則恐有問題。<br>曾有一老人久病不癒，其子至省城隍廟許願祈求保佑，抽得此籤。未多久，老人病逝；正應了第三句「作福問神難得過」。
     	</p>";
    }elseif ($a == 14) {
     	echo "
     	<h1>第 14 籤　&nbsp;丙寅籤</h1>
     	<img  src='14.png'><br>
     	<p>
     	財運來臨漸漸顯明，正像那花開花謝後，結成滿樹的果實。不必焦急，且寬心等待中秋節到來，你所等待的郎君將來與你共渡那太平愜意的日子了！<br>至友李君出國久無音訊，其夫人至省城隍廟抽得此籤，不久，在中秋前夕，李君自國外歸來，正應了第三、四句，傳為奇談。<br>抽到此籤，如問事業，表示你的事業已有轉機，你的財運也將慢慢到來，即使目前財利不顯，但只要耕耘，必有收穫。只怕不肯用心，隨世浮沉，就像那花開花謝，月亮盈虧，得失相伴。問功名，也是一樣，如果不去充實自己，只想碰運氣，是難得有成就的。問婚姻，有情人終成眷屬之兆，婚談可成。問訴訟，只要出以至誠，必能平安無事，能破財消災，是為上策，意氣之爭‧ 得不償失。
     	</p>";
     }elseif ($a == 15) {
     	echo "
     	<h1>第 15 籤　&nbsp;丙辰籤</h1>
     	<img  src='15.png'><br>
     	<p>
     	姜太公到八十歲，仍然懷才不遇，只好在渭水河釣魚等待時機，一直等到文王聽到他的賢名，來拜訪他，才時來運轉，受到文王的重用。你目前的情況，跟太公的遭遇一樣，請不必多問，還是勸你學學姜太公的作法，且等待那運氣亨通時。<br>抽到此籤，表示目前做事，總不如意，但別灰心，這不是因你不努力，而是時機未到。目前，最重要的是充實你自己，只要真才實幹，必有重用你的時候，決不會被埋沒的！<br>問功名，不必急尋，你是屬於大器晚成型。問移居或職位變動，還不是時機，一動不如一靜。出外旅行，無利可圖。問訴訟，以和為貴。問婚姻，多屬晚婚，應下定決心，婚談可成。<br>據聞中部有某小飯館，取名「候時機」，乃因主人至省城隍廟抽得此籤，知道自己時運未到，暫時做做小生意，以等待時機，故店號乃取名「候時機」，以表其志。
     	</p>";
     }elseif ($a == 16) {
     	echo "
     	<h1>第 16 籤　&nbsp;丙午籤</h1>
     	<img  src='16.png'><br>
     	<p>
     	福份，不須去尋求，也不須去製造。你儘管用盡心機想去追求，結果還是失望，休想得到。因為陽世裏的人不知陰間裏善惡果報的事，而你的福份乃是你前世為善的因果。一個人在陽世所作所為，到了陰間都要接受審判。作惡多端的人，須要下地獄受苦刑，任不得你自由。<br>這首籤詩提示得籤的人，一切運氣的好壞，不是你可以祈求製造，乃是上天的安排，用以報償你的心田好壞。所謂：「積苦之家必有餘慶，積惡之家必有餘殃。」「善有善報，惡有惡報，不是不報，時日未到。」因此，如果你目前未得好報，做事營謀未能遂意，求財沒有得到，不必強求，也不必怨嘆，只有多努力，積善因，終必感動上天，賜給你好運氣。<br>問目前運途，浮沉不定。問功名，難有進展。問婚姻，緣份未到，婚談難成。問移居出外，均不吉，一動不如一靜。問訴訟，須修心，不可意氣用事，得饒人處且饒人，總以能和為貴。
     	</p>";
    }elseif ($a == 17) {
     	echo "
     	<h1>第 17 籤　&nbsp;丙申籤</h1>
     	<img  src='17.png'><br>
     	<p>
     	回憶往事，心頭舊恨重重未消除，正如家中發生災禍，雖然沒有臨到本身，但此恨綿綿無盡期。你須要謹慎提防再有事故發生，最好多作好事，只要有善因，必能逢凶化吉，而且在辰巳交會的時刻，得到很圓滿的結果。<br>此籤暗示抽籤的人，即使經歷了無數次的失敗，無數次的辛酸，無數次的恨事，但不必去記掛它，還是東山再起，再振作努力去幹，必有出人頭地的一天。此籤有貴人，但必須心田好，所以籤詩說：「須當謹防宜作福。」只要心地良好，必能逢凶化吉，化險為夷，並得天賦福運。<br>問功名，只要充分準備，即使一次挫折，算不得什麼，再次必取。問婚姻，緣份已到，婚談可成。出外不吉，無利可圖。移居，隨意可行。
     	</p>";
     }elseif ($a == 18) {
     	echo "
     	<h1>第 18 籤　&nbsp;丙戌籤</h1>
     	<img  src='18.png'><br>
     	<p>
     	如果你要問這中間的因果，請看看「祿馬貴人」幫助你前程的發展，就可領悟。如果你能得到「貴人」的幫助，自然一切順利，一切都能圓滿和合。<br>抽得此籤，表示你這個人心田好，善心自有善報，做事求財，自然會有「貴人」幫助你，使你成功，問功名，這是大吉之兆，可以積極去發揮，表現你的才能，你未來前程光明遠大，自不在話下。<br>問婚姻，是佳偶天成的好預兆，婚談可成，有情人終成眷屬，可喜可賀！<br>移居、外出、職位變動，均吉。此籤惟問疾病，不吉，須有「貴人」出現，才有療癒的希望。<br>友人李某，四十未娶，親友常勸其成家，或熱心作媒，均不成功。一次，李君赴省城隍廟抽得此籤，果然於戊午年獲得良緣，乃一富家女。正應了「祿（富）馬（午年）拱前程」句。
     	</p>";
     }elseif ($a == 19) {
     	echo "
     	<h1>第 19 籤　&nbsp;丁丑籤</h1>
     	<img  src='19.png'><br>
     	<p>
     	俗云：「 生死有命，富貴在天。」一個人的窮通禍福、富貴貧賤，都是上天安排、命裏註定的，所謂「命裏有時終須有，命裏無時莫強求。」如果你期望太高，必定會大失望，而且耽誤了你的佳期。<br>既然新路走不通，何不回頭走走舊路，說不定還能雲開月出，見到光明的前途哩！<br>一個人，當然須要有開創局面的雄心，但野心太大，超過了本身的能力，只想好大喜功，反會招致失敗的。還有「謀事在人，成事在天。」同樣的才能，同樣的努力，並不一定就有同樣的成功，這裏面當然有「命」「運」的因素在作祟，所以，明理的人不要太奢求！<br>「條條道路通羅馬。」成功並不一定都要開創新路，前人走過的舊路，有時你也可以跟著上去，一樣會成功的！此籤問事業，創新不吉，守舊安泰。問求財，不多，財多則身弱，反為不吉。功名難得，婚姻平平。移居出外，均不吉。
     	</p>";
    }elseif ($a == 20) {
     	echo "
     	<h1>第 20 籤　&nbsp;丁卯籤</h1>
     	<img  src='20.png'><br>
     	<p>
     	前途功名，未能得意發展，恐怕是因為命裏還有交錯坎坷的運氣。<br>家庭不可分兩家，如果分兩家，一定會有損失，必須防備，所以勸你還是退守本分，不必唉聲嘆氣！這首籤警告當事人，要注意家庭問題，不要只顧事業，而忽略了家庭。更不宜金屋藏嬌，以免家庭革命！這是走桃花運的預兆，故須慎防美人計！<br>問財運，到目前，都不能如願，若有亦是前手來後手空，不宜過份強求，須防破財或劫財。問婚姻或家庭運，均不吉。婚談，如無感情，不易成功。婚姻須防有變！問功名，待來年，今年恐希望不大。出外做事、移居、職位變動，均不宜妄動。<br>一日，有位姓吳的持此籤來求解，余觀其面相，奸門魚尾部分氣色暗淡，正如籤詩所言，恐有家庭問題。詰問之下，吐露實情，正因金屋藏嬌，為太太發現，大鬧家庭革命。余曰：「此籤教你要退讓，向太太陪罪，取得諒解，否則將有大損失。」但因情難捨，終至身敗名裂！
     	</p>";
     }elseif ($a == 21) {
     	echo "
     	<h1>第 21 籤　&nbsp;丁巳籤</h1>
     	<img  src='21.png'><br>
     	<p>
     	十方佛法無邊，神通廣大，只要你信仰虔誠，即使遭遇大難禍患，結局自亦不同，所謂「吉人天相」，自然逢凶化吉，化險為夷！何況陽光普照之下，又有「貴人」到家裏保佑你呢！<br>這首籤，表示你有困難，但只要你能誠敬做事，自然會克服困難而成功。遭遇困難，人人都會有，只看你的毅力和努力如何，結果當然就不同了！<br>問求財，表示先難後易。問功名，能修善，自有神助。問婚姻，有媒可成。問訴訟；先凶後吉。問出外或移居，普通平平。<br>有某婦女，接國外丈夫來信，言近日中返國，未言明何日，乃抽得此籤來求解，余曰：「明日中午可到！」蓋以「紅日當空常照耀」有「明」「午」之意，「貴人」可做「丈夫」解。翌日中午，其丈夫果然到家。
     	</p>";
     }elseif ($a == 22) {
     	echo "
     	<h1>第 22 籤　&nbsp;丁未籤</h1>
     	<img  src='22.png'><br>
     	<p>
     	姜太公到八十歲才成立家業，你何必急呢？一個人的機會一到，就像那雲開月出，光輝馬上普照天下，大放光明！命中時機若到，自然飛黃騰達，大吉大利。在時機未來前，就暫時隱守在家裡等候吧，這樣反可以百事順利呢！<br>抽到此籤，表示時機未到，必須等待。一個人如果機會未到，硬要強出頭，只有自尋煩惱。像那姜太公雖是一位人才，但到八十歲遇到文王，才真正有表現的機會，你可能也是屬於大器晚成型。<br>此籤問謀事，目前恐尚不如意，但只要持之有恆，努力充實自己，必有被重用的一天。問求財，財運尚不多。問婚姻，有情人終成眷屬。問出外移居，尚可。
     	</p>";
    }elseif ($a == 23) {
     	echo "
     	<h1>第 23 籤　&nbsp;丁酉籤</h1>
     	<img  src='23.png'><br>
     	<p>
     	要想到長江去垂釣，但只見汪洋一片，使人感到前途茫茫，不知何去何從？手拿著釣竿長線，痴痴的等待，只恐怕魚兒與水無緣，不會來了！<br>這是一首比喻的籤詩，魚水用來形容君臣之相得，也用來比喻夫婦的相愛。用垂釣，象徵求取名利。所以這首籤如果問功名，有懷才不遇之感，還要等候時機，目前恐怕難有被重用的機會。<br>問財利，目前尚欠理想。問出外，無利可圖。移居、改換環境也許不錯。問婚姻，如果你有中意的對象，就釣住吧，莫等待，讓魚兒都跑掉了！<br>張君年屆不惑，尚未成家，乃往省城隍廟求籤，抽得此籤。余問：「有無對象？」答：「無。」余曰：「就登報徵婚吧，不垂釣，那來魚兒？」張君照所示登報徵婚。果然不多久，就接到張君請喝喜酒的帖子了。
     	</p>";
     }elseif ($a == 24) {
     	echo "
     	<h1>第 24 籤　&nbsp;丁亥籤</h1>
     	<img  src='24.png'><br>
     	<p>
     	正如俗語云：「十年寒窗無人問，一舉成名天下知。」錦繡前程，就如月出光輝，四海皆明，人人仰望。那坎坷的過去，就像烏雲般被一掃而光了。此去太平無事，可以不必再憂慮禍患臨身！<br>這是一首苦盡甘來的籤詩。有一分耕紜，必有一分收穫。過去對苦難的奮鬥，終得發出勝利的光輝，沒有過去的努力，那來今日的成就？所以，抽到此籤，表示有志者事竟成，天下沒有不勞而獲的事。<br>問功名，只要自己有實學，必可高中無憂。不愁沒有職位，只怕你不具有勝任職位的才能。不必東奔西跑，出外、移動，都無利可圖。問財運，小則有，要想發大財，尚須靠機會。<br>某對男女，好事多磨，婚姻難成。後抽得此籤，喜出望外，果然不久，雙方家長均表示同意，有情人終成眷屬。
     	</p>";
     }elseif ($a == 25) {
     	echo "
     	<h1>第 25 籤　&nbsp;戊子籤</h1>
     	<img  src='25.png'><br>
     	<p>
     	前途總有命運安排，你只要盡其在我去努力奮鬥，不必勞心去求神問卜，那只是多枉費精神。你要解決的事，只要等待「酉」「戌」日過了以後，就會有消息的。不必再去祈福求神了！<br>這首籤詩明白告訴當事人，解決問題，惟有靠白己，光是求神問卜，是解決不了問題的。雞為酉，犬為戌，故關鍵在酉戌日後，即能獲得答案。<br>此籤表示一動不如一靜，故問出外、移居，均不好。問功名，惟有靠自己多用功，靠運氣、或神佑，那是沒有希望的。如果沒為充分的準備，金榜題名的希望不大。問婚姻，要看男女雙方是否真愛，雙方如果情投意合，可成。<br>據說從有人登報尋人，久無音訊，至省城隍廟求得此籤，後果然於戌日尋獲。
     	</p>";
    }elseif ($a == 26) {
     	echo "
     	<h1>第 26 籤　&nbsp;戊寅籤</h1>
     	<img  src='26.png'><br>
     	<p>
     	詩云：「有花堪折直須折，莫待無花空折枝。」已經評選出來的第一枝牡丹花，美麗動人，勸你不要遲疑，快把握機會折取下來。如要尋問世間知音在何處，大地逢春是時機！一切行樂須及時，莫待春去空惆悵！<br>這是一首比喻的籤詩，告訴常事人莫錯過了時機。有人說：「製造機會的人，是第一流人才；把握機會的人，是第二流人才，不要把機會錯失，成了不入流的人才。<br>此籤問求財，財運有，但須把握，以免錯過發財機會。出外、移居，動則均有利。營謀做事，要積極主動，不可猶豫不決。問婚姻，天賜良緣，莫遲疑，婚姻可成。
     	</p>";
     }elseif ($a == 27) {
     	echo "
     	<h1>第 27 籤　&nbsp;戊辰籤</h1>
     	<img  src='27.png'><br>
     	<p>
     	勸你不必為俗事操心，且寬心自由自在地生活。只要家裡平安無事，財利自然源源而來。凡事命裏有時終須有，命裏無時莫強求。<br>俗語說：「是福不必躲，是禍躲不過。」任何事情，求順其自然最好。此籤即告訴當事人，一切聽從命運安排，不必憂慮操心。<br>問財利，憑各人財運大小，不要妄求。問功名，且寬心等待，是人才不會讓你永遠埋沒，終有讓你發揮的一天，教你還是待價而沽，不必急於賤賣。問婚姻，平和之良緣，不必操之過急，誠懇與耐心，是成功的條件。<br>某日，有李太太至舍下，出示此籤求解。問何所求，答曰：「飛機失事，欲知丈夫安危？」余曰：「此籤所示，一切平安，不必憂慮。」後其先生果然平安歸來。問何以知？余曰：「籤詩中有『凡事無傷不用求』句，故知之。」
     	</p>";
     }elseif ($a == 28) {
     	echo "
     	<h1>第 28 籤　&nbsp;戊午籤</h1>
     	<img  src='28.png'><br>
     	<p>
     	英雄好漢莫提當年勇，此一時，彼一時，不要將現時仍與當年比。就像那老虎，一落到平地裡，英雄無用武之地，連小犬都敢欺負他。世間上的事，有什麼難於決定的呢？就是千山萬水的困雞，也不必遲疑，就決定勇往直前吧。<br>抽到此籤，問求財，應該積極進取，自然財源如「千山萬水」源源而來。但若問功名，此籤有懷才不遇、「虎落平洋」、英雄無用武之地的感嘆。問婚姻，恐阻礙重重，難於談成，宜另找適當的對象。移居、出外，均不吉，如非緊急要事，宜暫緩行動。<br>有趙某應聘出國，臨行抽得此籤來問吉凶，余曰：「此去恐無甚發展，最好不應聘。」他說機票已訂，乃後天班，不能變更。後來落魄返國，悔當時未談妥條件，致出國後被剝削，無法反抗也。正應了：「虎落平洋被犬欺」。
     	</p>";
    }elseif ($a == 29) {
     	echo "
     	<h1>第 29 籤　&nbsp;戊申籤</h1>
     	<img  src='29.png'><br>
     	<p>
     	雪萊西風頌名句：「冬天來了，春天還會遠嗎？」目前雖然是寒冷的冬天，但轉眼間春天一到，枯木逢春，自然生意盎然。但現在，只有在暗中等待機會。你不必太心急，且寬心地等待，等到風霜退了，春天自然來到，你仍然有春光明媚的天下!<br>由剝而復，否極泰來，這是自然的定律，就像那四季的遞嬗，冬去春來，嚴寒的冬霜退後，就是春光明媚的時侯。抽到此籤，表示你即使目前遭遇困難，但不必灰心，這正是磨練你的機會，只要你克服了眼前的困難，接著展開的是平坦的康莊大道。<br>此籤問求財，利雖微薄，仍有。問功名，時機未到，尚須埋頭讀書。問婚姻，成功的機會渺茫，只得暫時等待。至於這椿婚事的好壞，乃先苦後甘之象。移居、出外，暫時一動不如一靜。
     	</p>";
     }elseif ($a == 30) {
     	echo "
     	<h1>第 30 籤　&nbsp;戊戌籤</h1>
     	<img  src='30.png'><br>
     	<p>
     	事情會慢慢變化，但這個月中還不致有太大的變化，然而過了這個月，就要防患未然，不可好高騖遠，以免失望。你要改變一下作法，再向前途邁進，否則，徒勞無功，白費心機！<br>此籤在警告當事人要注意盛極必衰的預兆，不能不謹慎你的作法，以確保過去努力的成果。尤其不可因過去稍有成就，即擴張過速，會吃虧的！<br>民國六十二年，景氣過熱，各工廠紛紛擴張設備，囤積原料，大賺特賺之際，有某工廠老板持此籤來問吉凶。余曰：「此籤意不贊成你貸款擴張，因為第一二句明顯的告訴你，這種景氣過熱，不久會有變化的。而且你這種貸款做生意的方法，必須要改變一下，不然，將來會因貸款太多而弄得週轉不靈。」該老板仍然好高騖遠，未重視籤意所示，貸款擴張工廠，終於民國六十四年因銀行緊縮貸款時，陷入週轉不靈而倒閉。<br>抽到此籤，問求財，微利可取，奢望大利，恐白費精神。問功名，成功希望渺茫。問婚姻，恐有變化，難於成功。出外、移居，一動不如一靜，均不宜。
     	</p>";
     }elseif ($a == 31) {
     	echo "
     	<h1>第 31 籤　&nbsp;已丑籤</h1>
     	<img  src='31.png'><br>
     	<p>
     	正是楊柳蒼翠成蔭的時候，你應該把握時機，好好去闖天下，開展你的事業！好好耕種，自然會開花結果，天下事沒有不勞而獲的。一分耕紜，一分收穫。積善之家，必有餘慶，好好播種心田，福祿自然滿家門！<br>這是一首有大收穫的吉籤。但天下沒有不勞而獲的事，要收穫，必須先耕種。只要你勤耕耘，必得大豐收。<br>問事業，抽到此籤，只要埋頭苦幹，必能完成大業。此籤具有蓄財（花果結實）繁榮（綠柳蒼蒼）等吉象，應好自把握之。問功名，有金榜題名之兆。出外移居，均大吉。<br>有徐姓青年，聽聞余善解靈籤，亦至省城隍廟抽得此籤來余處求解。余問求籤何為？該青年謂擬單槍匹馬赴歐洲應騁。余曰：「可行，將來必有成就。」二年後，該青年返國至余處道謝，並問何以得知該行必有成就。余曰：「籤詩明示，任君此去作乾坤，故知之。」該青年甚讚籤詩靈驗，並對余善解籤意，表示信服。
     	</p>";
    }elseif ($a == 32) {
     	echo "
     	<h1>第 32 籤　&nbsp;已卯籤</h1>
     	<img  src='32.png'><br>
     	<p>
     	龍爭虎鬥，終會兩敗俱傷。事情的發生，常常是互相關連的。俗云：「運氣來時，鐵變黃金；運氣去時，黃金變鐵。」一切事應以和為責，命裡無時莫強求。自求多福，當以和為責，如果勾心鬥角不肯讓人，求神仙作福也不會有用的。<br>此籤告誡當事人，處世對人，要以和為貴。不可意氣用事，與人相爭，那樣做是沒有好處的。尤其是訴訟打官司，更要避免。古語云：「訟則凶。」應記取此教訓。曾有某當事人涉及傷害案件，至城隍廟抽得此籤來問吉凶，余曰：「此籤神明示意，和解為貴，如果雙方再意氣用事，官司打下去，雙方都得不到好處。」原來該當事人借錢給對方，對方不還錢，該當事人一氣之下將對方打傷。後來，言明返還借款一半，不再追究傷害，撒回告訴，一場風暴也就平息了。<br>問求財，門市生意有利，出外則無利可圖。問功名，成績差，須再充實自己。移居出外，均不得時，最好能商討後再決定。<br>龍為辰，虎為寅，故此籤龍虎相交，又可解為寅辰相交的月份或日子。曾有一人於某年底持籤來問一筆土地買賣可成否。余曰：「照此籤意，須到明年正月（寅）至三月（辰）間才有可能。」後果然。
     	</p>";
     }elseif ($a == 33) {
     	echo "
     	<h1>第 33 籤　&nbsp;已巳籤</h1>
     	<img  src='33.png'><br>
     	<p>
     	要去外鄉，須經過水茫茫無際的長江，揚起帆來，卻無風助行。還是安守家裏，用心經營，也許後福不錯，會遇到如魚得水的好機會哩！<br>抽到此籤，表示一動不如一靜。尤其出外旅行，阻礙多，不達目的，應予終止此行計劃。萬事宜採取退守之方針，言行嚴謹，處事謹慎，以為獲得安泰之計。<br>問財運，總會有，但不宜操之過急。門市生意比較好，出外經營則難獲如意。問功名，恐須第二次再接再厲才有希望。問婚姻，不易成功。然如以熱情有恆地週旋下去，或有希望。如無愛情，宜早日另找對象。<br>某僑胞來台尋親，久無音訊，正失望欲回僑居地，有人勸至省城隍廟問卜，抽得此籤。余曰：「有希望，因籤詩中有『得相逢』句，惟須再『 用心』一番」。後來得某報記者發佈尋親消息，竟然獲得相逢。
     	</p>";
     }elseif ($a == 34) {
     	echo "
     	<h1>第 34 籤　&nbsp;已未籤</h1>
     	<img  src='34.png'><br>
     	<p>
     	走過危險的高山，此去已是平坦的康莊大道，別嫌這條道路太遠，慢慢的總會到達目的地。看看那蘭桂，也是慢慢成長開花，只要有恆心，蛇也有修成龍的一天！<br>此籤告訴當事人，有恆為成功之本，不要怕困難，下要嫌費力，尤其不可半途而廢，那是永遠沒有成功的希望。俗語云：「天下無難事，只怕有心人。」<br>抽到此籤，表示經過長久的艱辛萬苦，開始解運而邁向順利之大道，應把握良機，積極進取。向南方推進有利。問功名，這次成績不理想，繼續努力下次可獲良好表現。問求職，暫時無法獲得理想職位，但熱誠奔跑，可獲成功。問婚姻，最初難免發生種種阻撓，但畢竟是良緣，成功與否，全靠熱誠與努力。
     	</p>";
    }elseif ($a == 35) {
     	echo "
     	<h1>第 35 籤　&nbsp;已酉籤</h1>
     	<img  src='35.png'><br>
     	<p>
     	這件事情不必再用心機了，未來的變化，自然會知道的。看以後情形，當有和合的一天。從現在開始，已有轉機，會漸漸脫出厄運，而看見太平的時光！<br>這首籤詩乃告示當事人所煩惱的事情，已有轉機了，未來的變化，是漸漸變好，不必再擔憂了。抽到此籤，如問婚姻，表示不用急，有恆地推進，就可得到成功，是逐漸發展而得的幸福良緣。<br>此籤問求財，不能十分理想，也有六七分以上希望。問功名，有高中的吉象。訴訟官司，有獲勝的希望，如受冤枉，亦有平反的機會。<br>曾有某被告因牽連搶劫案，其實係被誤認冤枉，其家人甚擔憂，至省城隍廟抽得此籤，余曰：「此籤最後一句有『漸漸脫出見太平』，應該會獲判無罪而被釋放！」後果然因逮到真正犯人而被釋。
     	</p>";
     }elseif ($a == 36) {
     	echo "
     	<h1>第 36 籤　&nbsp;已亥籤</h1>
     	<img  src='36.png'><br>
     	<p>
     	你的福祿像東海那麼大，你的壽命像南山那麼高，有這樣福壽雙全的命，還嘆什麼苦難呢！既然命裡已有，自然大吉大利，只要祈禱，就獲得平安！<br>這是一首很幸運的籤詩。表示福壽都有，就該知足，此謂「知足常樂」，如果你還有煩惱，就是自尋的了！<br>此籤除了表示功名遂福祿全外，如問訴訟，表示得直，如問生病，可以痊癒，如問婚姻，表示美滿。不過，這一首籤詩，如係問創新事業，或出外經營，則有考慮的必要。因為全籤的意思，要你知足常樂，不必再去自找勞苦。<br>曾有某一退休人員，家境富裕，但因無工作不好打發時聞，乃與友人合夥經營餐廳，事前抽得此籤，以其吉籤而未多考慮。後來被合夥人騙去巨款，後悔莫及。
     	</p>";
     }elseif ($a == 37) {
     	echo "
     	<h1>第 37 籤　&nbsp;庚子籤</h1>
     	<img  src='37.png'><br>
     	<p>
     	人遇到得意的好運氣，身價也隨著變化。福至心靈，你身所從事的，都會是有益的事情。前途一向無難事，只要你有決斷，自然事事順利。<br>這首籤詩表示你將有好運氣來臨。所以不要猶疑不決，應該當機立斷；從事你認為應當做的事，決不會錯。此籤問財運，雖無十分，也有六七分。俗云：「大富由天，小富由勤儉。」只要努力工作，自有財利可求。問婚姻，只要不三心兩意，有情人終得成眷屬。問功名，此次成績也許不理想，只要再努力用功，多加充實，下次一定有希望。出外移居，平正可行。<br>某作家窮極潦倒，一日，赴南部尋友支助未果，偶經省城隍廟，抽得此籤。未多久，獲得某出版社賞識，出版其著作，竟然一時洛陽紙貴，頗為風行，正應了：「運逢得意身顯變」。
     	</p>";
    }elseif ($a == 38) {
     	echo "
     	<h1>第 38 籤　&nbsp;庚寅籤</h1>
     	<img  src='38.png'><br>
     	<p>
     	堅守中正立場，不偏不倚，名位自然顯。不須向神祈求，心裏自然安祥。看看那早晚太陽的升沉，就會領悟到，惟有堅守中間立場，才能及時得意起來。<br>此籤原意，乃告訴當事人，處世做人不宜太偏激，應該採取中庸的態度，這樣，才能獲得心安理得，人家也自然會敬重起你來。<br>抽到此籤，問求財，宜守舊，不可貪求。心中存著正直，自然無憂。問謀事，雖有成功的希望，但時問上恐久延。談婚姻，在時間上也是比較遲延。問訴訟，則以和解為宜。問疾病，目前還無法痊癒，尚須待一段時間。友人張君，報名參加高考，<br>不知能否高中，乃赴省城隍廟求得此籤，後高中金榜，分發經濟部服務。經濟部屬中央級機關，正應了「名顯有意在中央」句，真妙哉！
     	</p>";
     }elseif ($a == 39) {
     	echo "
     	<h1>第 39 籤　&nbsp;庚辰籤</h1>
     	<img  src='39.png'><br>
     	<p>
     	你意中如果想尋求神仙的道路，我勸你還是不要妄想，且退一步看看那高樓吧！ （好高騖遠，終究一事無成）。還是寬心安份守己，寬心地等候一下機會，一定會有貴人來幫助你的。<br>抽到此籤，表示運氣不很理想，不宜挺進，宜退守以等待時運的解通。不要想一步登天，做任何事，要量力而為，自然會有貴人來提拔你。<br>此籤表示一動不如一靜，故出外移居，必須重新考慮。問求財，份外的要求無法達成。問功名，只是虛名，必須再充實自己，才能名實相符。問訴訟，與人爭執不利，官司和解為貴。問謀事，有長輩或貴人提拔，宜多聽取或尊重他人之意見。問婚姻，不必心急，有緣自然結成夫婦，不可強求。
     	</p>";
     }else {
     	echo "
     	<h1>第 40 籤　&nbsp;庚午籤</h1>
     	<img  src='40.png'><br>
     	<p>
     	古云：「死生由命，富貴在天。」平生只要有富貴之命，一定有祿位可求，也一定能光耀門楣。家和萬事成，只要夫妻百年和合，夫唱婦隨，一定不會有什麼損失的！<br>某君因其妻未生男，欲納偏房，乃赴省城隍廟求卜，得此籤，一見「夫妻百歲喜相隨」，乃作罷，家庭因而免於破裂，其後竟得一男，正應了「此中必定無損失」句。<br>此籤問求財，乃得順利達到目的。問功名，有金榜題名的吉兆。<br>李君參加特種考試，夜夢乘金龍上天，不知主何吉凶，乃赴廟求籤，得此籤，果高中金榜，正應了前二句「平生富貴成祿位，君家門戶定生輝」。<br>此籤問婚姻，乃和好順利與幸福之良緣。問謀事，則須下一番功夫。問訴訟，以和為貴。
     	</p>";
    }

	?>
<br>
	<form action="3-2.php" method="post">
    <p class="r">
     	<input type="submit" name="drawlot" value="再抽一次">
     </p>
    </form>

</body>
</html>
